import 'dart:convert';
import 'package:flutter/material.dart';
import 'package:new_wallpaper/module/QuoteModule.dart';
import 'package:http/http.dart' as http;

class Quote with ChangeNotifier {
  List<QuoteModule> quoteList = [];

  Future<void> fetchQuote() async {
    try {
      final res = await http.get(Uri.parse('https://type.fit/api/quotes'));
      final jsonData = jsonDecode(res.body);
      quoteList =
          jsonData.map<QuoteModule>((e) => QuoteModule.fromJson(e)).toList();
      notifyListeners();
    } catch (error) {
      print(error);
    }
  }


  final words =
      "mother,mom,father,dad,parent,children,son,daughter,sister,brother,grandmother,grandfather,grandparent,grandson,granddaughter,grandchild,aunt,uncle,niece,nephew,cousin,husband,wife,sister-in-law,brother-in-law,mother-in-law,father-in-law,Accomplish,Accomplishments,Achieve,Act,Action,Active,Admiration,Admire,Adventure,Alive,Ambition,Ambitious,Appreciate,Appreciation,Attain,Attitude,Beauty,Believe,Believable,Bliss,Breakdown,Breathtaking,Build,Catalyst,Challenge,Clarity,Commit,Commitment,Compassion,Complete,Concentrate,Confidence,Content,Control,Conquer,Courage,Create,Dare,Dedicate,Dedication,Desire,Determination,Determine,Dream,Dreams,Drive,Eager,Earnest,Empower,Empowering,Empowerment,Encourage,Encouragement,Encouraging,Endurance,Endure,Energetic,Energy,Enjoy,Enjoyment,Enthusiasm,Envision,Escape,Excellence,Experiences,Faith,Faithful,Faithfulness,Fearless,Fighter,Finish,Finisher,Fire,Fix,Focus,Forgive,Freedom,Fulfilment,Glory,Goal,Goodness,Gratitude,Happiness,Happy,Harmony,Honesty,Honor,Hope,Humble,Humility,Hunger,Imagination,Imagine,Impetus,Improve,Incentive,Ineffable,Initiative,Inspiration,Inspire,Inspiring,Integrity,Interest,Joy,Joyful,Joyfulness,Kind,Kindness,Know,Knowledge,Laugh,Lead,Leading,Learn,Life,Live,Limitless,Love,Loving,Mindful,Mindset,Mission,Meaning,Meaningful,Memories,Momentum,Motivate,Motivated,Motivation,Motive,Move,Movement,Moving,Now,Nurture,Obstacles,Opportunity,Optimistic,Outstanding,Overcome,Passion,Patience,Peace,Peaceful,Peacefulness,Persevere,Perseverance,Persist,Persistence,Persuade,Plan,Planner,Positive,Possibilities,Power,Powerful,Practice,Pride,Prioritize,Reach,Rise,Risk,Role,Safe,Safety,Satisfaction,Satisfy,Secure,Security,Self,Skill,Skilful,Skilfulness,Spirit,Spirited,Spur,Stimulus,Strength,Strong,Succeed,Success,Sustain,Sustenance,Teach,Teachable,Time,Trust,Trustworthy,Truth,Understand,Understood,Value,Versatile,Will,Willpower,Winner,Wisdom,Wise,Worthy,Yearning,Yes";

  List<QuoteModule> kurdishQuote = [
    QuoteModule(
        text:
            'هەرکەسێك پەلە بکات  لەناو خەڵکى بەکردنى ئەو شتانەى پێیان ناخۆشە ، شتى واى دەربارەى دەڵێن کە لەو کەسەدانین .',
        author: "علی کوری ئەبیتالب"),
    QuoteModule(
        text:
            'ئاگات لە پیاوى خانەدان بێت ئەگەر برسی بوو یان ئەگەر ئیهانەت کرد ، وە ئاگات لە ناکەس بەچەبێت ئەگەر تێرى خوارد .',
        author: "علی کوری ئەبیتالب"),
    QuoteModule(
        text:
            'ئارام گرتن دوو جۆرە : ئارام گرتنێک لەسەر شتێک کەپێت ناخۆشەو ، ئارام گرتنێک لەسەر شتنێک کەپێت خۆشە .',
        author: "علی کوری ئەبیتالب"),
    QuoteModule(
        text:
            'دانایی لە ئینسانی بڕوادار ون بووە ، وە دانایی و زانست وەربگرە لە هەر کەسێک بێت ، ئەگەر دوور رووش بێت . ',
        author: "علی کوری ئەبیتالب"),
    QuoteModule(
        text:
            'ئەو زانایەى کە کار بە زانینەکەى ناکات نەزانین دەیپێکێت و عیلم و زانستەکەشی سوودى پێ ناگەیەنێت . ',
        author: "علی کوری ئەبیتالب"),
    QuoteModule(
        text:
            'ئەو کەسەى لە فەرمایشتەکانى خوداو پێغەمبەر لانەدات رەزامەندیی خودا بە دەست دەهێنێت . ',
        author: "علی کوری ئەبیتالب"),
    QuoteModule(
        text: "بلیمەت لە سەدا یەک ئیلهامە و لە سەدا نەوەد و نۆ هەناسەدان",
        author: "تۆماس ئێدیسۆن"),
    QuoteModule(
        text: "خانووێک کە دژ بە خۆی دابەش کراوە ناتوانێت بوەستێت",
        author: "ئەبراهام لینکۆلن"),
    QuoteModule(
        text:
            'دۆستێک نابێتە دۆستى راستە قینە تا وەکو دۆستەکەى لە سێ شتان نەپارێزیت : لە نارەحەت و ماندوو کردنى ، وەلە غەیبەت کردنى وەلە کاتى مردنى دا چاودێرى یەکی دڵسۆزانەى بکات . ',
        author: "علی کوری ئەبیتالب"),
    QuoteModule(
        text:
            'هەموو بەڵایەک ئارامگرتنێکى تایبەتى ى خۆى هەیە ، وە هەر کەسێک لە کاتى نە هامەتى و نارەحەتى یەک  لە خۆى بدات ئەوە ریسی لێ دەبێتەوە بەخورى و کردارەکانى لێ هەڵدەوشێتەوە .',
        author: "علی کوری ئەبیتالب"),
    QuoteModule(
        text:
            'خۆشەویستترین کەس لەلاى ئەو کەسەیە کەیادگارى یەکانى لاى تۆ هەبن ، ئەگەر یادگاریشی لەلات نەبوو ئەوا یادگارى یەکانى تۆ لەلاى ئەو هەنە . ',
        author: "علی کوری ئەبیتالب"),
    QuoteModule(
        text:
            'کوری خۆم :گوێرایەلی وەك بازرگانی وەربگرە قازانجێکی زۆر دەکەیت بەبێ کەلو پەل لەخوابترسە ، باخەلکی واتەمەشات نەکەن کەتو لەخوائەترسی تارێزت لێبگرن و دلیشت بێ',
        author: 'لوقمانی حەکیم'),
    QuoteModule(
        text:
            'ئەی کوری خۆم : یەکەم شت کەبەکەلکت بێتو رزگارت بکات دووای باورە بەخوا هاورێیەتی چاک ،بەراستی هاورێیەتی چاك وەك دارخورماوایە ، یان لەسێبەرەکەی دادەنیشی ، یان لەبەرەشیرینەکەی ئەخۆیت یان سود لەلقەکانی وەردەگریت .',
        author: 'لوقمانی حەکیم'),
    QuoteModule(
        text:
            'کوری خۆم : سەربەرزی بۆ ئەوەی دونیا سەری لێنەشێواندوە لەخۆبای نەبوە رۆژی قیامەت پەشیمان بێتەوە',
        author: 'لوقمانی حەکیم'),
    QuoteModule(
        text:
            'کورەکەم : زمان کلیلی جاکەو خرابەیە ، دەتۆش زمانت مۆرێکی لێدە هەروەك جۆن مۆر لەزێر وزیو دەدەیت ، تەنها بۆجاکەبەکاری بێنە .',
        author: 'لوقمانی حەکیم'),
    QuoteModule(
        text:
            'کورەکەم : بەکەم رازی بە ، قەنعاتت بە بەشی خۆت ببێت و چاوت لەمالی خەلكی نەبێت جونکە',
        author: 'لوقمانی حەکیم'),
    QuoteModule(
        text:
            'کورکەم : کاری جاکە بکەو وریای خراپە بە بەجاکە خراپە ئەکوژرێتەوە ، ئەگەر ئەو قسەیە راستە ئاگر لای ئاگر بکەرەوە بزانە ئایە دەی کوژێنێتەوە ؟! بەلام خراپە بەجاکە دەکوژێتەوە هەروەك جۆن ئاگر بە ئاو دەکوژێتەوە .',
        author: 'لوقمانی حەکیم'),
    QuoteModule(
        text: "بلیمەت لە سەدا یەک ئیلهامە و لە سەدا نەوەد و نۆ هەناسەدان",
        author: "تۆماس ئێدیسۆن"),
    QuoteModule(
        text: "خانووێک کە دژ بە خۆی دابەش کراوە ناتوانێت بوەستێت",
        author: "ئەبراهام لینکۆلن"),
    QuoteModule(
        text:
            'ڕۆلەکەم : دەزانی خواپەرسترین کەس کێیە ؟ ئەو کەسەیە کە بەلایەوە گرنگ نیە خەلك ناو زاراوەیێ و بەخراپی بزانن، ئاسایە بەلایەوە لەبەر چاوی خەلکی کاری خراپ ئەنجام بدات .',
        author: 'لوقمانی حەکیم'),
    QuoteModule(
        text:
            'کەسێک کەسەر بەرزى بەهۆى زوڵم و ستەمەوە بە دەست بێنێت ، خوا بەویژدان و حەق زەلیل و زەبونى دەکات . ',
        author: "علی کوری ئەبیتالب"),
    QuoteModule(
        text:
            'غەیرى خودا داوا لە هیچ کەس مەکە چونکە هەر ئەو پێت دەبەخشێت و هەر ئەویش دەوڵەمەندت دەکات . ',
        author: "علی کوری ئەبیتالب"),
    QuoteModule(
        text:
            "هەوڵ بدە بۆ هاوڕێ ى باش و دڵسۆز نەک هاوڕێ ى زۆرو نەناسراو چونکە هەزار دۆست بە دوژمنێکت لەگەڵدا دەکات . ",
        author: "علی کوری ئەبیتالب"),
    QuoteModule(
        text:
            'ئەگەر تووشی ناڕەحاتى یەک بووى ئەگەر دەتوانیت بەهۆى تاکتیکێک رووبەڕووى ببیەوە ئەوا دڵ تەنگ مەبە وە ئەگەر تواناى رووبەڕوو بونەوەشت نەبێت ئەوا بێ ئومێد مەبە . ',
        author: "علی کوری ئەبیتالب"),
    QuoteModule(
        text:
            'ئەوەى کە دەیڵێ ى ووردبەرەوە چونکە دوو چاودێرى هەمیشتە چاودێرى ى هەر هەنگاوێکت دەکەن کەجێ بەجێ ى دەکەى . وە ئەم صحیفەیەى کە لەسەر کردەوەکانت پڕ دەکرێتەوە راستەوخۆ بۆ خوا دەنێنررێن . ',
        author: "علی کوری ئەبیتالب"),
    QuoteModule(
        text:
            'مرۆڤ سێ جۆرن : مرۆڤى دڵ پڕ باوەڕو چاکەکار کە کارێک دەکات تەنیا لەبەر خاترى خواو چاوەڕوانى پاداشتى خەڵک نى یە و مرۆڤی مام ناوەندیش کارێک دەکات بەرەغبەتى خۆى و وە مرۆڤی پەست کارێک دەکات کە سەرشۆڕى تیادایە . ',
        author: "علی کوری ئەبیتالب"),
    QuoteModule(
        text:
            'خواردن ئەوەى پێت خۆشە بیخۆ بەڵام خوو ڕەوشتت وا بێت کە خەڵک لێ ى رازى بێت .  ',
        author: "علی کوری ئەبیتالب"),
    QuoteModule(
        text:
            ' پشت بەو کەسە مەبەستە کەلەبەر خاتوى ماڵ و دەستەڵات رێزت دەگرێت ، بەڵکو بە کەسێک کەلەبەر دین و رەووشت بەرزى رێزت دەگرێت . ',
        author: "علی کوری ئەبیتالب"),
    QuoteModule(
        text:
            'پێش ئەوەى کەسەنەدێک ئیمزا بکەى بەووردى سەرنجی بدە بۆ ئەوەى لە ئیمزاکەت پەشیمان نەبیتەوە',
        author: "علی کوری ئەبیتالب"),
    QuoteModule(
        text:
            'ئەگەر یەکێک لە ئێوە ووتی وەڵڵا (بەخوا) بابزانێت لەدوایەوە دەڵێت . ',
        author: "علی کوری ئەبیتالب"),
    QuoteModule(
        text:
            'کوری شیرینم : یەکەم شت کەپێویستە لەسەرت ئاگات لێیبت نەفستە بەراستی هەمونەفسێك ئارازووی هەیە ، ئەگەر گوێت بەئارازووەکانت ندا ئەوا سنور دەبەزێنێت ، بەراستی شەهوەتو ئارازوو لەلدا شاراوەیە وەك شاراوەیی ئاگر لەبەرددا ، ئەگەر دابگیرسێ دەردەکەوێ و ئەگەر داشنەگیرسێت ، هەر شاراوەیە .',
        author: 'لوقمانی حەکیم'),
    QuoteModule(
        text:
            'کەلەهەمویان گەورەتر و گرنکتر ئەوەیە کەوابزانیت هەمووخەلکی سەرەوی زەوی لەو جاکترن خۆشی لەهەویان خراپتر ئەگەر جاکەی لەکیێك بینی پێی دلخۆش بێ و ئاواتی بێت پێی بگات ئەگەر خراپەی لەکەسێکیش بینی بلێ ئایە ئەم کارە خۆت و کەسوکارت سەرفراز رزگاردەکات ئەمەش کاتێ دەبێ کە عاقلی تەواو و کامول بوبێت .',
        author: 'لوقمانی حەکیم'),
    QuoteModule(
        text:
            'کوری شیرینم : ئاقلی هیچ مرۆڤێك تەواو کامل نابێت تا دەشتی تیانەبێت',
        author: 'لوقمانی حەکیم'),
    QuoteModule(
        text:
            'کوری خۆم : باقسەت خۆشبێت و بارووت خۆشبێت ئەوکاتە زۆر خۆشەویست تردەبیت لای خەلکی لەو کەسەی کەدەبەخشێت .',
        author: 'لوقمانی حەکیم'),
    QuoteModule(
        text:
            'کوری خۆم : هەول بدە بەمندالی فێری زانست بە جونکە فێربونی زانست بەگەورەی قورسە .',
        author: 'لوقمانی حەکیم'),
    QuoteModule(
        text:
            'کوری شیرینم : دەمە دەمی لەگەل زانایاندا مەکە جونکە لەسەریان قورس و متمانەت لایان نامێنێت دەمەدەمیش لەگەل نەزاناندا مەکە جونکە کاری نەشیاوت بەرانبەر دەکەن و جوێنێت دەدەن بەلکو ئارام بگرە بەرانبەر ئەوانەی کەلەزانستدا لەسەروو خۆتەوەن و ئەوانەشی لەخوارخۆتەون ، چونکە کەسێك دەگات بەئاستی زانایان کە ئارامبگرێ بەرامبەریان و هەمیشە لەگەڵیان بی و بەنەرمونیانی زانستەکەیان لێ وەربگریت',
        author: 'لوقمانی حەکیم'),
    QuoteModule(
        text:
            'کوری خۆم : لەبەرسێ شت فیری زانست مەبە و لەبەر سێ شتیش وازی لێمەهێنە فێری مەبە لۆ ئەوەی دەمەقالی پێبکەی یان شانازی پێبکەیت یان خۆتی پێ دەربخەی وازیش لێ مەهێنە لەبەر زهدت بۆی یان شەرم کردنت لەخەلکی یان رازی بونت بەنەفامی .',
        author: 'لوقمانی حەکیم'),
    QuoteModule(
        text:
            'کوری خۆم : بۆ ئەوە زانستە فێرنەبین کە خۆتی پیا رادەی بەسەر زانایاندا و دەمەقاڵێی پێبکەی لەگەل نەفاماندا و خۆتی پێ دەربخەی لەناو گۆر کوبونەوەکاندا وازیش لەفێربونی زانست مەهێنە لەبەر زوهت تیایدا و حەزکردنت لەنەفامی .',
        author: 'لوقمانی حەکیم'),
    QuoteModule(
        text:
            'کورم : ئاوات بەکەسێك مەخوازە کە خوێنی باورداران ئەرژێنت ، ئەو کەسە لای خوا بکوژێکی بۆ هەیە کەنامرێت .',
        author: 'لوقمانی حەکیم'),
    QuoteModule(
        text:
            'کوری شیرینم : بەراستی غونەی ئەوانەی کە یادی خوا ئەکەن و ئەوانەی کەیادی ناکەن وەك روناکی و تاریکی وایە .',
        author: 'لوقمانی حەکیم'),
    QuoteModule(
        text:
            'کوری خۆم :گوێرایەلی وەك بازرگانی وەربگرە قازانجێکی زۆر دەکەیت بەبێ کەلو پەل لەخوابترسە ، باخەلکی واتەمەشات نەکەن کەتو لەخوائەترسی تارێزت لێبگرن و دلیشت بێ',
        author: 'لوقمانی حەکیم'),
    QuoteModule(
        text:
            'ئەی کوری خۆم : یەکەم شت کەبەکەلکت بێتو رزگارت بکات دووای باورە بەخوا هاورێیەتی چاک ،بەراستی هاورێیەتی چاك وەك دارخورماوایە ، یان لەسێبەرەکەی دادەنیشی ، یان لەبەرەشیرینەکەی ئەخۆیت یان سود لەلقەکانی وەردەگریت .',
        author: 'لوقمانی حەکیم'),
    QuoteModule(
        text:
            'کوری خۆم : سەربەرزی بۆ ئەوەی دونیا سەری لێنەشێواندوە لەخۆبای نەبوە رۆژی قیامەت پەشیمان بێتەوە',
        author: 'لوقمانی حەکیم'),
    QuoteModule(
        text:
            'کورەکەم : زمان کلیلی جاکەو خرابەیە ، دەتۆش زمانت مۆرێکی لێدە هەروەك جۆن مۆر لەزێر وزیو دەدەیت ، تەنها بۆجاکەبەکاری بێنە .',
        author: 'لوقمانی حەکیم'),
    QuoteModule(
        text:
            'کورەکەم : بەکەم رازی بە ، قەنعاتت بە بەشی خۆت ببێت و چاوت لەمالی خەلكی نەبێت جونکە',
        author: 'لوقمانی حەکیم'),
    QuoteModule(
        text:
            'کورکەم : کاری جاکە بکەو وریای خراپە بە بەجاکە خراپە ئەکوژرێتەوە ، ئەگەر ئەو قسەیە راستە ئاگر لای ئاگر بکەرەوە بزانە ئایە دەی کوژێنێتەوە ؟! بەلام خراپە بەجاکە دەکوژێتەوە هەروەك جۆن ئاگر بە ئاو دەکوژێتەوە .',
        author: 'لوقمانی حەکیم'),
    QuoteModule(
        text:
            'ڕۆلەکەم : دەزانی خواپەرسترین کەس کێیە ؟ ئەو کەسەیە کە بەلایەوە گرنگ نیە خەلك ناو زاراوەیێ و بەخراپی بزانن، ئاسایە بەلایەوە لەبەر چاوی خەلکی کاری خراپ ئەنجام بدات .',
        author: 'لوقمانی حەکیم'),
    QuoteModule(
        text:
            " تۆڵە لە تەماع بستێنە بە قەناعەت هەر وەکو چۆن تۆڵە لە دوژمنت دەستێنی بەقصاص",
        author: "علی کوری ئەبیتالب"),
    QuoteModule(
        text: 'هاوڕێیەتى کەسێک بکە کەسپڵە نی یە .',
        author: "علی کوری ئەبیتالب"),
    QuoteModule(
        text: 'چاکە بژییەنەوەو پیادەى کە بەبێ گۆڕانکارى .',
        author: "علی کوری ئەبیتالب"),
    QuoteModule(
        text:
            'هەرکەسێك پەلە بکات  لەناو خەڵکى بەکردنى ئەو شتانەى پێیان ناخۆشە ، شتى واى دەربارەى دەڵێن کە لەو کەسەدانین .',
        author: "علی کوری ئەبیتالب"),
    QuoteModule(
        text:
            'ئاگات لە پیاوى خانەدان بێت ئەگەر برسی بوو یان ئەگەر ئیهانەت کرد ، وە ئاگات لە ناکەس بەچەبێت ئەگەر تێرى خوارد .',
        author: "علی کوری ئەبیتالب"),
    QuoteModule(
        text:
            'ئارام گرتن دوو جۆرە : ئارام گرتنێک لەسەر شتێک کەپێت ناخۆشەو ، ئارام گرتنێک لەسەر شتنێک کەپێت خۆشە .',
        author: "علی کوری ئەبیتالب"),
    QuoteModule(
        text:
            'دانایی لە ئینسانی بڕوادار ون بووە ، وە دانایی و زانست وەربگرە لە هەر کەسێک بێت ، ئەگەر دوور رووش بێت . ',
        author: "علی کوری ئەبیتالب"),
    QuoteModule(
        text:
            'ئەو زانایەى کە کار بە زانینەکەى ناکات نەزانین دەیپێکێت و عیلم و زانستەکەشی سوودى پێ ناگەیەنێت . ',
        author: "علی کوری ئەبیتالب"),
    QuoteModule(
        text:
            'ئەو کەسەى لە فەرمایشتەکانى خوداو پێغەمبەر لانەدات رەزامەندیی خودا بە دەست دەهێنێت . ',
        author: "علی کوری ئەبیتالب"),
    QuoteModule(
        text:
            'دۆستێک نابێتە دۆستى راستە قینە تا وەکو دۆستەکەى لە سێ شتان نەپارێزیت : لە نارەحەت و ماندوو کردنى ، وەلە غەیبەت کردنى وەلە کاتى مردنى دا چاودێرى یەکی دڵسۆزانەى بکات . ',
        author: "علی کوری ئەبیتالب"),
    QuoteModule(
        text:
            'هەموو بەڵایەک ئارامگرتنێکى تایبەتى ى خۆى هەیە ، وە هەر کەسێک لە کاتى نە هامەتى و نارەحەتى یەک  لە خۆى بدات ئەوە ریسی لێ دەبێتەوە بەخورى و کردارەکانى لێ هەڵدەوشێتەوە .',
        author: "علی کوری ئەبیتالب"),
    QuoteModule(
        text: "خانووێک کە دژ بە خۆی دابەش کراوە ناتوانێت بوەستێت",
        author: "ئەبراهام لینکۆلن"),
    QuoteModule(
        text: "بەردێکی هەڵگەڕاو هیچ کۆ ناکاتەوە", author: 'پوملیوس سیروس'),
    QuoteModule(
        text:
            'خۆشەویستترین کەس لەلاى ئەو کەسەیە کەیادگارى یەکانى لاى تۆ هەبن ، ئەگەر یادگاریشی لەلات نەبوو ئەوا یادگارى یەکانى تۆ لەلاى ئەو هەنە . ',
        author: "علی کوری ئەبیتالب"),
    QuoteModule(
        text:
            'کەسێک کەسەر بەرزى بەهۆى زوڵم و ستەمەوە بە دەست بێنێت ، خوا بەویژدان و حەق زەلیل و زەبونى دەکات . ',
        author: "علی کوری ئەبیتالب"),
    QuoteModule(
        text:
            'غەیرى خودا داوا لە هیچ کەس مەکە چونکە هەر ئەو پێت دەبەخشێت و هەر ئەویش دەوڵەمەندت دەکات . ',
        author: "علی کوری ئەبیتالب"),
    QuoteModule(
        text:
            "هەوڵ بدە بۆ هاوڕێ ى باش و دڵسۆز نەک هاوڕێ ى زۆرو نەناسراو چونکە هەزار دۆست بە دوژمنێکت لەگەڵدا دەکات . ",
        author: "علی کوری ئەبیتالب"),
    QuoteModule(
        text:
            'ئەگەر تووشی ناڕەحاتى یەک بووى ئەگەر دەتوانیت بەهۆى تاکتیکێک رووبەڕووى ببیەوە ئەوا دڵ تەنگ مەبە وە ئەگەر تواناى رووبەڕوو بونەوەشت نەبێت ئەوا بێ ئومێد مەبە . ',
        author: "علی کوری ئەبیتالب"),
    QuoteModule(
        text:
            'ئەوەى کە دەیڵێ ى ووردبەرەوە چونکە دوو چاودێرى هەمیشتە چاودێرى ى هەر هەنگاوێکت دەکەن کەجێ بەجێ ى دەکەى . وە ئەم صحیفەیەى کە لەسەر کردەوەکانت پڕ دەکرێتەوە راستەوخۆ بۆ خوا دەنێنررێن . ',
        author: "علی کوری ئەبیتالب"),
    QuoteModule(
        text:
            'مرۆڤ سێ جۆرن : مرۆڤى دڵ پڕ باوەڕو چاکەکار کە کارێک دەکات تەنیا لەبەر خاترى خواو چاوەڕوانى پاداشتى خەڵک نى یە و مرۆڤی مام ناوەندیش کارێک دەکات بەرەغبەتى خۆى و وە مرۆڤی پەست کارێک دەکات کە سەرشۆڕى تیادایە . ',
        author: "علی کوری ئەبیتالب"),
    QuoteModule(
        text:
            'خواردن ئەوەى پێت خۆشە بیخۆ بەڵام خوو ڕەوشتت وا بێت کە خەڵک لێ ى رازى بێت .  ',
        author: "علی کوری ئەبیتالب"),
    QuoteModule(
        text:
            ' پشت بەو کەسە مەبەستە کەلەبەر خاتوى ماڵ و دەستەڵات رێزت دەگرێت ، بەڵکو بە کەسێک کەلەبەر دین و رەووشت بەرزى رێزت دەگرێت . ',
        author: "علی کوری ئەبیتالب"),
    QuoteModule(
        text:
            'پێش ئەوەى کەسەنەدێک ئیمزا بکەى بەووردى سەرنجی بدە بۆ ئەوەى لە ئیمزاکەت پەشیمان نەبیتەوە',
        author: "علی کوری ئەبیتالب"),
    QuoteModule(
        text:
            'ئەگەر یەکێک لە ئێوە ووتی وەڵڵا (بەخوا) بابزانێت لەدوایەوە دەڵێت . ',
        author: "علی کوری ئەبیتالب"),
    QuoteModule(
        text:
            'کوری شیرینم : یەکەم شت کەپێویستە لەسەرت ئاگات لێیبت نەفستە بەراستی هەمونەفسێك ئارازووی هەیە ، ئەگەر گوێت بەئارازووەکانت ندا ئەوا سنور دەبەزێنێت ، بەراستی شەهوەتو ئارازوو لەلدا شاراوەیە وەك شاراوەیی ئاگر لەبەرددا ، ئەگەر دابگیرسێ دەردەکەوێ و ئەگەر داشنەگیرسێت ، هەر شاراوەیە .',
        author: 'لوقمانی حەکیم'),
    QuoteModule(
        text:
            'کەلەهەمویان گەورەتر و گرنکتر ئەوەیە کەوابزانیت هەمووخەلکی سەرەوی زەوی لەو جاکترن خۆشی لەهەویان خراپتر ئەگەر جاکەی لەکیێك بینی پێی دلخۆش بێ و ئاواتی بێت پێی بگات ئەگەر خراپەی لەکەسێکیش بینی بلێ ئایە ئەم کارە خۆت و کەسوکارت سەرفراز رزگاردەکات ئەمەش کاتێ دەبێ کە عاقلی تەواو و کامول بوبێت .',
        author: 'لوقمانی حەکیم'),
    QuoteModule(
        text:
            'کوری شیرینم : ئاقلی هیچ مرۆڤێك تەواو کامل نابێت تا دەشتی تیانەبێت',
        author: 'لوقمانی حەکیم'),
    QuoteModule(
        text: "بلیمەت لە سەدا یەک ئیلهامە و لە سەدا نەوەد و نۆ هەناسەدان",
        author: "تۆماس ئێدیسۆن"),
    QuoteModule(
        text: "خانووێک کە دژ بە خۆی دابەش کراوە ناتوانێت بوەستێت",
        author: "ئەبراهام لینکۆلن"),
    QuoteModule(
        text: "بەردێکی هەڵگەڕاو هیچ کۆ ناکاتەوە", author: 'پوملیوس سیروس'),
    QuoteModule(
        text:
            'کوری خۆم : باقسەت خۆشبێت و بارووت خۆشبێت ئەوکاتە زۆر خۆشەویست تردەبیت لای خەلکی لەو کەسەی کەدەبەخشێت .',
        author: 'لوقمانی حەکیم'),
    QuoteModule(
        text:
            'کوری خۆم : هەول بدە بەمندالی فێری زانست بە جونکە فێربونی زانست بەگەورەی قورسە .',
        author: 'لوقمانی حەکیم'),
    QuoteModule(
        text:
            'کوری شیرینم : دەمە دەمی لەگەل زانایاندا مەکە جونکە لەسەریان قورس و متمانەت لایان نامێنێت دەمەدەمیش لەگەل نەزاناندا مەکە جونکە کاری نەشیاوت بەرانبەر دەکەن و جوێنێت دەدەن بەلکو ئارام بگرە بەرانبەر ئەوانەی کەلەزانستدا لەسەروو خۆتەوەن و ئەوانەشی لەخوارخۆتەون ، چونکە کەسێك دەگات بەئاستی زانایان کە ئارامبگرێ بەرامبەریان و هەمیشە لەگەڵیان بی و بەنەرمونیانی زانستەکەیان لێ وەربگریت',
        author: 'لوقمانی حەکیم'),
    QuoteModule(
        text:
            'کوری خۆم : لەبەرسێ شت فیری زانست مەبە و لەبەر سێ شتیش وازی لێمەهێنە فێری مەبە لۆ ئەوەی دەمەقالی پێبکەی یان شانازی پێبکەیت یان خۆتی پێ دەربخەی وازیش لێ مەهێنە لەبەر زهدت بۆی یان شەرم کردنت لەخەلکی یان رازی بونت بەنەفامی .',
        author: 'لوقمانی حەکیم'),
    QuoteModule(
        text:
            'کوری خۆم : بۆ ئەوە زانستە فێرنەبین کە خۆتی پیا رادەی بەسەر زانایاندا و دەمەقاڵێی پێبکەی لەگەل نەفاماندا و خۆتی پێ دەربخەی لەناو گۆر کوبونەوەکاندا وازیش لەفێربونی زانست مەهێنە لەبەر زوهت تیایدا و حەزکردنت لەنەفامی .',
        author: 'لوقمانی حەکیم'),
    QuoteModule(
        text:
            'کورم : ئاوات بەکەسێك مەخوازە کە خوێنی باورداران ئەرژێنت ، ئەو کەسە لای خوا بکوژێکی بۆ هەیە کەنامرێت .',
        author: 'لوقمانی حەکیم'),
    QuoteModule(
        text:
            'کوری شیرینم : بەراستی غونەی ئەوانەی کە یادی خوا ئەکەن و ئەوانەی کەیادی ناکەن وەك روناکی و تاریکی وایە .',
        author: 'لوقمانی حەکیم'),
    QuoteModule(
        text:
            " تۆڵە لە تەماع بستێنە بە قەناعەت هەر وەکو چۆن تۆڵە لە دوژمنت دەستێنی بەقصاص",
        author: "علی کوری ئەبیتالب"),
    QuoteModule(
        text: 'هاوڕێیەتى کەسێک بکە کەسپڵە نی یە .',
        author: "علی کوری ئەبیتالب"),
    QuoteModule(
        text: 'چاکە بژییەنەوەو پیادەى کە بەبێ گۆڕانکارى .',
        author: "علی کوری ئەبیتالب"),
    QuoteModule(
        text: "بلیمەت لە سەدا یەک ئیلهامە و لە سەدا نەوەد و نۆ هەناسەدان",
        author: "تۆماس ئێدیسۆن"),
    QuoteModule(
        text: "خانووێک کە دژ بە خۆی دابەش کراوە ناتوانێت بوەستێت",
        author: "ئەبراهام لینکۆلن"),
    QuoteModule(
        text: "بەردێکی هەڵگەڕاو هیچ کۆ ناکاتەوە", author: 'پوملیوس سیروس'),
  ];

  List<QuoteModule> arabicQuote = [
    QuoteModule(
        text: "الانتقام من نية الإقناع كما كنت الانتقام من عدوك",
        author: "علي ابن أبيتالب"),
    QuoteModule(
        text:
            'أي شخص يعجل بين الناس من خلال القيام بأشياء يكرهون يقول ما يقولونه عن من نحن.',
        author: 'علي ابن أبيتالب'),
    QuoteModule(text: "حجر متدحرج لا يجمع الطحالب", author: "بوبليوس سايروس"),
    QuoteModule(
        text:
            'رعاية رجل نبيل إذا كان جائعا أو أهان، ويكون على بينة من أي شخص إذا كان راضيا',
        author: 'علي ابن أبيتالب'),
    QuoteModule(
        text: 'الصبر هو نوعان: الصبر على شيء كنت لا تحب، والصبر على شيء تريد.',
        author: 'علي ابن Abitalb'),
    QuoteModule(
        text: "منزل منقسم ضد نفسه لا يمكن أن يقف.", author: "أبراهام لينكولن"),
    QuoteModule(
        text:
            'تضيع الحكمة من المؤمن، وتأخذ الحكمة والعلم من أي شخص، إذا كان بعيدا. ',
        author: "علي كوري أبيتالب"),
    QuoteModule(
        text:
            'العالم الذي لا يعمل مع علمه لا يعرف ولا يستفيد من العلم والعلم. ',
        author: "علي كوري أبيتالب"),
    QuoteModule(
        text: 'الشخص الذي لا يؤمن بكلمات الله والنبي يحصل على موافقة الله. ',
        author: "علي كوري أبيتالب"),
    QuoteModule(
        text:
            'الابن: هل الأعمال الصالحة وتوخي الحذر من أن الشر سيتم إخماد. إذا كان هذا صحيحا، وإشعال النار في النار، ومعرفة ما اذا كان سيتم إيقاف تشغيله؟ ولكن الشر سوف إيقاف جاك كما جون إيقاف النار بالماء.',
        author: 'لقمان حكيم'),
    QuoteModule(
        text:
            "دوري: هل تعرف من هو الشخص الأكثر إلها؟ هو الشخص الذي لا يهتم بالناس باللهجة ويعتقد أنه من السيء بالنسبة له أن يفعل أشياء سيئة في أعين الناس.",
        author: "لقمان حكيم"),
    QuoteModule(
        text:
            'الشخص الذي يكسب رأس عالية بسبب الظلم والظلم، والله يهين وإذلال له بضمير والحقيقة. ',
        author: "علي كوري أبيتالب"),
    QuoteModule(
        text: 'لا تسأل أي شخص آخر غير الله، لأنه سوف تعطيك وانه سوف يثري لك. ',
        author: "علي كوري أبيتالب"),
    QuoteModule(
        text:
            "حاول أن تكون صديقا جيدا ومخلصا، وليس صديقا غير معروف جدا، لأنه سيجعلك ألف صديق مع عدو.",
        author: "علي ابن أبيتالب"),
    QuoteModule(
        text: 'عبقرية هو واحد في المئة إلهام وتسعين في المئة العرق."',
        author: 'توماس أديسون'),
    QuoteModule(
        text: "منزل منقسم ضد نفسه لا يمكن أن يقف.", author: "أبراهام لينكولن"),
    QuoteModule(
        text: "الانتقام من نية الإقناع كما كنت الانتقام من عدوك",
        author: "علي ابن أبيتالب"),
    QuoteModule(
        text:
            'أي شخص يعجل بين الناس من خلال القيام بأشياء يكرهون يقول ما يقولونه عن من نحن.',
        author: 'علي ابن أبيتالب'),
    QuoteModule(text: "حجر متدحرج لا يجمع الطحالب", author: "بوبليوس سايروس"),
    QuoteModule(
        text:
            'رعاية رجل نبيل إذا كان جائعا أو أهان، ويكون على بينة من أي شخص إذا كان راضيا',
        author: 'علي ابن أبيتالب'),
    QuoteModule(
        text: 'الصبر هو نوعان: الصبر على شيء كنت لا تحب، والصبر على شيء تريد.',
        author: 'علي ابن Abitalb'),
    QuoteModule(
        text: "منزل منقسم ضد نفسه لا يمكن أن يقف.", author: "أبراهام لينكولن"),
    QuoteModule(
        text:
            'تضيع الحكمة من المؤمن، وتأخذ الحكمة والعلم من أي شخص، إذا كان بعيدا. ',
        author: "علي كوري أبيتالب"),
    QuoteModule(
        text:
            'العالم الذي لا يعمل مع علمه لا يعرف ولا يستفيد من العلم والعلم. ',
        author: "علي كوري أبيتالب"),
    QuoteModule(
        text: 'الشخص الذي لا يؤمن بكلمات الله والنبي يحصل على موافقة الله. ',
        author: "علي كوري أبيتالب"),
    QuoteModule(
        text:
            'الابن: هل الأعمال الصالحة وتوخي الحذر من أن الشر سيتم إخماد. إذا كان هذا صحيحا، وإشعال النار في النار، ومعرفة ما اذا كان سيتم إيقاف تشغيله؟ ولكن الشر سوف إيقاف جاك كما جون إيقاف النار بالماء.',
        author: 'لقمان حكيم'),
    QuoteModule(
        text:
            "دوري: هل تعرف من هو الشخص الأكثر إلها؟ هو الشخص الذي لا يهتم بالناس باللهجة ويعتقد أنه من السيء بالنسبة له أن يفعل أشياء سيئة في أعين الناس.",
        author: "لقمان حكيم"),
    QuoteModule(
        text:
            'الشخص الذي يكسب رأس عالية بسبب الظلم والظلم، والله يهين وإذلال له بضمير والحقيقة. ',
        author: "علي كوري أبيتالب"),
    QuoteModule(
        text: 'لا تسأل أي شخص آخر غير الله، لأنه سوف تعطيك وانه سوف يثري لك. ',
        author: "علي كوري أبيتالب"),
    QuoteModule(
        text:
            "حاول أن تكون صديقا جيدا ومخلصا، وليس صديقا غير معروف جدا، لأنه سيجعلك ألف صديق مع عدو.",
        author: "علي ابن أبيتالب"),
    QuoteModule(
        text: 'عبقرية هو واحد في المئة إلهام وتسعين في المئة العرق."',
        author: 'توماس أديسون'),
    QuoteModule(
        text: "منزل منقسم ضد نفسه لا يمكن أن يقف.", author: "أبراهام لينكولن"),
    QuoteModule(
        text: "الانتقام من نية الإقناع كما كنت الانتقام من عدوك",
        author: "علي ابن أبيتالب"),
    QuoteModule(
        text:
            'أي شخص يعجل بين الناس من خلال القيام بأشياء يكرهون يقول ما يقولونه عن من نحن.',
        author: 'علي ابن أبيتالب'),
    QuoteModule(text: "حجر متدحرج لا يجمع الطحالب", author: "بوبليوس سايروس"),
    QuoteModule(
        text:
            'رعاية رجل نبيل إذا كان جائعا أو أهان، ويكون على بينة من أي شخص إذا كان راضيا',
        author: 'علي ابن أبيتالب'),
    QuoteModule(
        text: 'الصبر هو نوعان: الصبر على شيء كنت لا تحب، والصبر على شيء تريد.',
        author: 'علي ابن Abitalb'),
    QuoteModule(
        text: "منزل منقسم ضد نفسه لا يمكن أن يقف.", author: "أبراهام لينكولن"),
    QuoteModule(
        text:
            'تضيع الحكمة من المؤمن، وتأخذ الحكمة والعلم من أي شخص، إذا كان بعيدا. ',
        author: "علي كوري أبيتالب"),
    QuoteModule(
        text:
            'العالم الذي لا يعمل مع علمه لا يعرف ولا يستفيد من العلم والعلم. ',
        author: "علي كوري أبيتالب"),
    QuoteModule(
        text: 'الشخص الذي لا يؤمن بكلمات الله والنبي يحصل على موافقة الله. ',
        author: "علي كوري أبيتالب"),
    QuoteModule(
        text:
            'الابن: هل الأعمال الصالحة وتوخي الحذر من أن الشر سيتم إخماد. إذا كان هذا صحيحا، وإشعال النار في النار، ومعرفة ما اذا كان سيتم إيقاف تشغيله؟ ولكن الشر سوف إيقاف جاك كما جون إيقاف النار بالماء.',
        author: 'لقمان حكيم'),
    QuoteModule(
        text:
            "دوري: هل تعرف من هو الشخص الأكثر إلها؟ هو الشخص الذي لا يهتم بالناس باللهجة ويعتقد أنه من السيء بالنسبة له أن يفعل أشياء سيئة في أعين الناس.",
        author: "لقمان حكيم"),
    QuoteModule(
        text:
            'الشخص الذي يكسب رأس عالية بسبب الظلم والظلم، والله يهين وإذلال له بضمير والحقيقة. ',
        author: "علي كوري أبيتالب"),
    QuoteModule(
        text: 'لا تسأل أي شخص آخر غير الله، لأنه سوف تعطيك وانه سوف يثري لك. ',
        author: "علي كوري أبيتالب"),
    QuoteModule(
        text:
            "حاول أن تكون صديقا جيدا ومخلصا، وليس صديقا غير معروف جدا، لأنه سيجعلك ألف صديق مع عدو.",
        author: "علي ابن أبيتالب"),
    QuoteModule(
        text: 'عبقرية هو واحد في المئة إلهام وتسعين في المئة العرق."',
        author: 'توماس أديسون'),
    QuoteModule(
        text: "منزل منقسم ضد نفسه لا يمكن أن يقف.", author: "أبراهام لينكولن"),
    QuoteModule(
        text: "الانتقام من نية الإقناع كما كنت الانتقام من عدوك",
        author: "علي ابن أبيتالب"),
    QuoteModule(
        text:
            'أي شخص يعجل بين الناس من خلال القيام بأشياء يكرهون يقول ما يقولونه عن من نحن.',
        author: 'علي ابن أبيتالب'),
    QuoteModule(text: "حجر متدحرج لا يجمع الطحالب", author: "بوبليوس سايروس"),
    QuoteModule(
        text:
            'رعاية رجل نبيل إذا كان جائعا أو أهان، ويكون على بينة من أي شخص إذا كان راضيا',
        author: 'علي ابن أبيتالب'),
    QuoteModule(
        text: 'الصبر هو نوعان: الصبر على شيء كنت لا تحب، والصبر على شيء تريد.',
        author: 'علي ابن Abitalb'),
    QuoteModule(
        text: "منزل منقسم ضد نفسه لا يمكن أن يقف.", author: "أبراهام لينكولن"),
    QuoteModule(
        text:
            'تضيع الحكمة من المؤمن، وتأخذ الحكمة والعلم من أي شخص، إذا كان بعيدا. ',
        author: "علي كوري أبيتالب"),
    QuoteModule(
        text:
            'العالم الذي لا يعمل مع علمه لا يعرف ولا يستفيد من العلم والعلم. ',
        author: "علي كوري أبيتالب"),
    QuoteModule(
        text: 'الشخص الذي لا يؤمن بكلمات الله والنبي يحصل على موافقة الله. ',
        author: "علي كوري أبيتالب"),
    QuoteModule(
        text:
            'الابن: هل الأعمال الصالحة وتوخي الحذر من أن الشر سيتم إخماد. إذا كان هذا صحيحا، وإشعال النار في النار، ومعرفة ما اذا كان سيتم إيقاف تشغيله؟ ولكن الشر سوف إيقاف جاك كما جون إيقاف النار بالماء.',
        author: 'لقمان حكيم'),
    QuoteModule(
        text:
            "دوري: هل تعرف من هو الشخص الأكثر إلها؟ هو الشخص الذي لا يهتم بالناس باللهجة ويعتقد أنه من السيء بالنسبة له أن يفعل أشياء سيئة في أعين الناس.",
        author: "لقمان حكيم"),
    QuoteModule(
        text:
            'الشخص الذي يكسب رأس عالية بسبب الظلم والظلم، والله يهين وإذلال له بضمير والحقيقة. ',
        author: "علي كوري أبيتالب"),
    QuoteModule(
        text: 'لا تسأل أي شخص آخر غير الله، لأنه سوف تعطيك وانه سوف يثري لك. ',
        author: "علي كوري أبيتالب"),
    QuoteModule(
        text:
            "حاول أن تكون صديقا جيدا ومخلصا، وليس صديقا غير معروف جدا، لأنه سيجعلك ألف صديق مع عدو.",
        author: "علي ابن أبيتالب"),
    QuoteModule(
        text: 'عبقرية هو واحد في المئة إلهام وتسعين في المئة العرق."',
        author: 'توماس أديسون'),
    QuoteModule(
        text: "منزل منقسم ضد نفسه لا يمكن أن يقف.", author: "أبراهام لينكولن"),
  ];
}
